export const sdAirPolStat:{} = {
  PM10: {
    min: 15.22931,
    max: 55.55303,
  },
  PM2_5: {
    min: 7.708983,
    max: 46.64152,
  },
  NO2: {
    min: 0.5088892,
    max: 38.31604,
  },
};

export const sggAirPolStat:{} = {
  PM2_5: {
    min: 9,
    max: 34,
  },
  burden: {
    min: 0.8,
    max: 132.1,
  },
};

export const sdHongMortality:{} = {
  burden: {
    min: 49.2,
    max: 2352.3,
  },
  PM2_5: {
    min: 13.6,
    max: 29.1,
  },
};

export const codeToSD:{} = {
  11: '서울특별시',
  21: '부산광역시',
  22: '대구광역시',
  23: '인천광역시',
  24: '광주광역시',
  25: '대전광역시',
  26: '울산광역시',
  29: '세종특별자치시',
  31: '경기도',
  32: '강원도',
  33: '충청북도',
  34: '충청남도',
  35: '전라북도',
  36: '전라남도',
  37: '경상북도',
  38: '경상남도',
  39: '제주특별자치도',
};

export const codeToSD_2015:{} = {
  11: '서울특별시',
  21: '부산광역시',
  22: '대구광역시',
  23: '인천광역시',
  24: '광주광역시',
  25: '대전광역시',
  26: '울산광역시',
  29: '세종시',
  31: '경기도',
  32: '강원도',
  33: '충청북도',
  34: '충청남도',
  35: '전라북도',
  36: '전라남도',
  37: '경상북도',
  38: '경상남도',
  39: '제주특별자치도',
};

export const shortSdName:{} = {
  '서울특별시': '서울',
  '부산광역시': '부산',
  '대구광역시': '대구',
  '인천광역시': '인천',
  '광주광역시': '광주',
  '대전광역시': '대전',
  '울산광역시': '울산',
  '세종특별자치시': '세종',
  '경기도': '경기',
  '강원도': '강원',
  '충청북도': '충북',
  '충청남도': '충남',
  '전라북도': '전북',
  '전라남도': '전남',
  '경상북도': '경북',
  '경상남도': '경남',
  '제주특별자치도': '제주',
};

export const codeToCenterLocation:{} = {
  11: '중구', // "서울특별시",
  21: '부산진구', // "부산광역시",
  22: '서구', // "대구광역시",
  23: '중구', // "인천광역시",
  24: '서구', // "광주광역시",
  25: '대전광역시', // "대전광역시",
  26: '남구', // "울산광역시",
  29: '세종특별자치시', // "세종특별자치시",
  31: '하남시', // "경기도",
  32: '평창군', // "강원도",
  33: '괴산군', // "충청북도",
  34: '청양군', // "충청남도",
  35: '임실군', // "전라북도",
  36: '강진군', // "전라남도",
  37: '의성군', // "경상북도",
  38: '의령군', // "경상남도",
  39: '서귀포시', // "제주특별자치도"
};

export const sdAdrrStat:{} = {
  NO2: {
    RRMin: 0.97,
    RRMax: 1.042,
    adMin: 0,
    adMax: 186,
  },

  PM2_5: {
    RRMin: 1.005,
    RRMax: 1.02,
    adMin: 1,
    adMax: 221,
  },

  PM10: {
    RRMin: 0.997,
    RRMax: 1.015,
    adMin: 0,
    adMax: 196,
  },
};

export const cd_to_nm:{} = {
  11: {
    location: '서울특별시',
    center: [126.956764, 37.520705],
    scale: 40 * 3,
  },
  21: {
    location: '부산광역시',
    center: [129.05055511923, 35.09925947222],
    scale: 30 * 3,
  },
  22: {
    location: '대구광역시',
    center: [128.60250, 35.77222],
    scale: 28 * 3,
  },
  31: {
    location: '경기도',
    center: [127.190292, 37.447167],
    scale: 10.1 * 3,
  },
  23: {
    location: '인천광역시',
    center: [126.2, 37.469221],
    scale: 13 * 3,
  },
  24: {
    location: '광주광역시',
    center: [126.8, 35.1],
    scale: 42 * 3,
  },
  25: {
    location: '대전광역시',
    center: [127.38500, 36.30111],
    scale: 42 * 3,
  },
  26: {
    location: '울산광역시',
    center: [129.24, 35.46889],
    scale: 34 * 3,
  },
  29: {
    location: '세종특별시',
    center: [127.28167, 36.55],
    scale: 35 * 3,
  },
  32: {
    location: '강원도',
    center: [128.2260705, 37.5004115],
    scale: 7 * 3,
  },
  33: {
    location: '충청북도',
    center: [127.929344, 36.628503],
    scale: 10 * 3,
  },
  34: {
    location: '충청남도',
    center: [126.779757, 36.487229],
    scale: 10 * 3,
  },
  35: {
    location: '전라북도',
    center: [127.144185, 35.716705],
    scale: 10 * 3,
  },
  36: {
    location: '전라남도',
    center: [126.893113, 34.819400],
    scale: 9 * 3,
  },
  37: {
    location: '경상북도',
    center: [128.57, 36.253],
    scale: 8 * 3,
  },
  38: {
    location: '경상남도',
    center: [128.3, 35.059787],
    scale: 10 * 3,
  },
  39: {
    location: '제주특별자치도',
    center: [126.542671, 33.364805],
    scale: 20 * 3,
  },
};
